SoapThrower/BAD/NewXML2.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Header>
		<ns2:RequestHeader xmlns="http://www.w3.org/2000/09/xmldsig#"
			xmlns:ns10="http://dom.gosuslugi.ru/schema/integration/payment/"
			xmlns:ns11="http://dom.gosuslugi.ru/schema/integration/organizations-base/"
			xmlns:ns12="http://dom.gosuslugi.ru/schema/integration/bills-base/"
			xmlns:ns2="http://dom.gosuslugi.ru/schema/integration/base/"
			xmlns:ns3="http://dom.gosuslugi.ru/schema/integration/house-management/"
			xmlns:ns4="http://dom.gosuslugi.ru/schema/integration/account-base/"
			xmlns:ns5="http://dom.gosuslugi.ru/schema/integration/services/"
			xmlns:ns6="http://dom.gosuslugi.ru/schema/integration/nsi-base/"
			xmlns:ns7="http://dom.gosuslugi.ru/schema/integration/organizations-registry-base/"
			xmlns:ns8="http://dom.gosuslugi.ru/schema/integration/metering-device-base/"
			xmlns:ns9="http://dom.gosuslugi.ru/schema/integration/individual-registry-base/">
			<ns2:Date>2016-12-29T10:55:00.199+07:00</ns2:Date>
			<ns2:MessageGUID>af248f69-22b8-4cb0-9a46-15f4c423b681
			</ns2:MessageGUID>
			<ns2:orgPPAGUID>b9fe4d27-020d-44dc-8bfd-b5972a504f45</ns2:orgPPAGUID>
			<ns2:IsOperatorSignature>true</ns2:IsOperatorSignature>
		</ns2:RequestHeader>
	</S:Header>
	<S:Body>
		<ns3:importHouseUORequest xmlns="http://www.w3.org/2000/09/xmldsig#"
			xmlns:ns10="http://dom.gosuslugi.ru/schema/integration/payment/"
			xmlns:ns11="http://dom.gosuslugi.ru/schema/integration/organizations-base/"
			xmlns:ns12="http://dom.gosuslugi.ru/schema/integration/bills-base/"
			xmlns:ns2="http://dom.gosuslugi.ru/schema/integration/base/"
			xmlns:ns3="http://dom.gosuslugi.ru/schema/integration/house-management/"
			xmlns:ns4="http://dom.gosuslugi.ru/schema/integration/account-base/"
			xmlns:ns5="http://dom.gosuslugi.ru/schema/integration/services/"
			xmlns:ns6="http://dom.gosuslugi.ru/schema/integration/nsi-base/"
			xmlns:ns7="http://dom.gosuslugi.ru/schema/integration/organizations-registry-base/"
			xmlns:ns8="http://dom.gosuslugi.ru/schema/integration/metering-device-base/"
			xmlns:ns9="http://dom.gosuslugi.ru/schema/integration/individual-registry-base/"
			ns2:version="11.0.0.1">
			<ns3:ApartmentHouse>
				<ns3:ApartmentHouseToCreate>
					<ns3:BasicCharacteristicts>
						<ns3:No_RSO_GKN_EGRP_Registered>true
						</ns3:No_RSO_GKN_EGRP_Registered>
						<ns3:FIASHouseGuid>bdc2d006-7f83-4ab2-be27-30ae0b725ade
						</ns3:FIASHouseGuid>
						<ns3:TotalSquare>1000.0</ns3:TotalSquare>
						<ns3:State>
							<ns6:Code>2</ns6:Code>
							<ns6:GUID>57c4dbc5-bdd5-4490-92e1-3e687797b32a</ns6:GUID>
							<ns6:Name>Исправный</ns6:Name>
						</ns3:State>
						<ns3:UsedYear>1977</ns3:UsedYear>
						<ns3:FloorCount>10</ns3:FloorCount>
						<ns3:OKTMO>
							<ns2:code>32607441101</ns2:code>
							<ns2:name>32607441101</ns2:name>
						</ns3:OKTMO>
						<ns3:OlsonTZ>
							<ns6:Code>10</ns6:Code>
							<ns6:GUID>8538e485-b925-4aa7-923f-3b6755e27d4b</ns6:GUID>
						</ns3:OlsonTZ>
						<ns3:CulturalHeritage>false</ns3:CulturalHeritage>
					</ns3:BasicCharacteristicts>
					<ns3:UndergroundFloorCount>0</ns3:UndergroundFloorCount>
					<ns3:MinFloorCount>1</ns3:MinFloorCount>
					<ns2:TransportGUID>8af06e1e-5e98-422f-ba9d-71f5f5304e32
					</ns2:TransportGUID>
				</ns3:ApartmentHouseToCreate>
			</ns3:ApartmentHouse>
		</ns3:importHouseUORequest>
	</S:Body>
</S:Envelope>
--------------------
